УчетВУправляющихДляГит1/src/Reports/РеестрСчетовФактурДляСверки/РеестрСчетовФактурДляСверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РеестрСчетовФактурДляСверки</name>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьЖурнала</name>
    <type>
      <types>EnumRef.ЧастиЖурналаУчетаСчетовФактур</types>
    </type>
  </attributes>
</mdclass:Report>

УчетВУправляющихДляГит1/src/Enums/ЧастиЖурналаУчетаСчетовФактур/ЧастиЖурналаУчетаСчетовФактур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЧастиЖурналаУчетаСчетовФактур</name>
  <enumValues>
    <name>ПолученныеСчетаФактуры</name>
  </enumValues>
  <enumValues>
    <name>ВыставленныеСчетаФактуры</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Reports/РеестрСчетовФактурДляСверки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("Контрагент");
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Заполнение",
			?(ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры,
				НСтр("ru = 'Покупатель'"),
				НСтр("ru = 'Поставщик'")),
			, , ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Контрагент", "Отчет", Отказ);
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
